## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Storage/storageAccounts/findatppr377logs"
        name                              = "findatppr377logs"
        tags                              = {
            "Environment"      = "pr-377"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "65.52.35.1",
              + "13.66.79.126",
              + "40.83.43.55",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-377applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-377httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Web/sites/find-a-tp-pr-377"
        name                              = "find-a-tp-pr-377"
        tags                              = {
            "Environment"      = "pr-377"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Storage/storageAccounts/findatppr377logs|find-a-tp-pr-377-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-377-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server.default must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "default" {
      ~ fqdn                          = "findatppr377-psqlflexible-server.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.DBforPostgreSQL/flexibleServers/findatppr377-psqlflexible-server" -> (known after apply)
      ~ name                          = "findatppr377-psqlflexible-server" -> "find-a-tp-pr-377-psqlflexible-server" # forces replacement
      + private_dns_zone_id           = (known after apply)
      ~ public_network_access_enabled = true -> (known after apply)
        tags                          = {
            "Environment"      = "pr-377"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (10 unchanged attributes hidden)

      - authentication {
          - active_directory_auth_enabled = false -> null
          - password_auth_enabled         = true -> null
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_configuration.extensions[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      ~ id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.DBforPostgreSQL/flexibleServers/findatppr377-psqlflexible-server/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.DBforPostgreSQL/flexibleServers/findatppr377-psqlflexible-server" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_database.default must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "default" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.DBforPostgreSQL/flexibleServers/findatppr377-psqlflexible-server/databases/find-a-tp-pr-377-db" -> (known after apply)
        name      = "find-a-tp-pr-377-db"
      ~ server_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.DBforPostgreSQL/flexibleServers/findatppr377-psqlflexible-server" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_firewall_rule.web_app_default_static_ip[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "web_app_default_static_ip" {
      ~ id               = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.DBforPostgreSQL/flexibleServers/findatppr377-psqlflexible-server/firewallRules/findatppr377webapp" -> (known after apply)
      ~ name             = "findatppr377webapp" -> "find-a-tp-pr-377webapp" # forces replacement
      ~ server_id        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.DBforPostgreSQL/flexibleServers/findatppr377-psqlflexible-server" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_redis_cache.default must be replaced
-/+ resource "azurerm_redis_cache" "default" {
      ~ hostname                      = "findatppr377-redis-cache.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Cache/redis/findatppr377-redis-cache" -> (known after apply)
      ~ name                          = "findatppr377-redis-cache" -> "find-a-tp-pr-377-redis-cache" # forces replacement
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "Environment"      = "pr-377"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (8 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 256 -> (known after apply)
          ~ maxfragmentationmemory_reserved = 30 -> (known after apply)
          ~ maxmemory_delta                 = 30 -> (known after apply)
          ~ maxmemory_reserved              = 30 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_redis_firewall_rule.web_app_default_static_ip must be replaced
-/+ resource "azurerm_redis_firewall_rule" "web_app_default_static_ip" {
      ~ id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Cache/redis/findatppr377-redis-cache/firewallRules/findatppr377webapp" -> (known after apply)
        name                = "findatppr377webapp"
      ~ redis_cache_name    = "findatppr377-redis-cache" -> "find-a-tp-pr-377-redis-cache" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377"
        name     = "s177d01-ntp-pr-377"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-377"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-377/providers/Microsoft.Storage/storageAccounts/findatppr377logs"
      ~ ip_rules                   = [
          - "13.66.79.126",
          - "40.83.43.55",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 4 to change, 6 to destroy.
```
</details>